{
  "basics": {
    "label": "User Interface Engineer and Lead",
    "website": "https://www.clintandrewhall.com",
    "email": "resume@clintandrewhall.com",
    "other": [],
    "name": "Clint Andrew Hall",
    "summary": "I'm an Engineering Lead and User Interface Engineer.  I work to make the web beautiful, both on its surface and beneath.\n\nI'm a demonstrated expert in HTML, CSS and JavaScript, React/Flux/Relay, and more.  I specialize in techniques promoting web agnostics, semantics, and accessibility.  I'm comfortable with varying levels of skill in any web full stack, having written and maintained production code in JS, PHP, Java and Ruby-on-Rails.  I currently prefer React+Node or React Native for most of my personal projects.\n\nI'm a regular consumer and occasional contributor to open source projects and client APIs.  If I have a suggestion for a website or application, I prefer to demonstrate the idea using an API rather than just describe it-- Code Wins Arguments.\n\nI look for opportunities where I can make strong, direct and meaningful contributions to a team, to users and to the web. I'm comfortable functioning as both designer and engineer, advising on both the technical and aesthetic.  I'm affable and good-natured, yet results-driven and competitive.  I have extensive experience working remotely, particularly during my time at Facebook and Elastic.",
    "picture": "https://www.gravatar.com/avatar/302764dcbe429cbf873064a2b8653da4.jpg?s=200",
    "profiles": [
      {
        "network": "github",
        "username": "clintandrewhall",
        "url": "https://github.com/clintandrewhall"
      },
      {
        "network": "linkedin",
        "username": "clintandrewhall",
        "url": "https://www.linkedin.com/in/clintandrewhall"
      },
      {
        "network": "twitter",
        "username": "clintandrewhall",
        "url": "https://twitter.com/clintandrewhall"
      },
      {
        "network": "facebook",
        "username": "clint.hall",
        "url": "https://facebook.com/clint.hall"
      },
      {
        "network": "instagram",
        "username": "clintandrewhall",
        "url": "https://instagram.com/clintandrewhall"
      }
    ]
  },
  "work": [
    {
      "company": "Elastic",
      "position": "Tech Lead, Shared UX",
      "startDate": "2021-12-15",
      "summary": "I'm the Tech Lead for Shared User Experience (UX) for the Application Experience organization at Elastic.  The team was conceived by me and other leaders to bridge the gap between design and the myriad of solutions that comprise the Application Experience organization.  Our mission is to make consistency across our solutions a product.  My role is leading the team through a technology lens, coordinating projects, and consulting with other tech leaders across Elastic.\n\nMy team is responsible for creating, maintaining and supporting shared UX infrastructure, like components, hooks and services.  We also promote patterns from our design organizations, fostering adoption through evangelism and codifying them in our infrastructure.  We're also responsible for unique UX solutions, driving our projects across organizations, and consulting with teams to deliver consistent experiences.",
      "highlights": [
        "[kibana/130355](https://github.com/elastic/kibana/pull/130355) - Create multi-package strategy for components",
        "[kibana/127546](https://github.com/elastic/kibana/pull/127546) - Create Package-based Architecture for Shared UX",
        "[kibana/123772](https://github.com/elastic/kibana/pull/123772) - Create Customer Chat component for Kibana in Cloud",
        "Pitch and develop team mission, strategy, and roadmap"
      ]
    },
    {
      "company": "Elastic",
      "position": "Area Lead, Presentation Team",
      "startDate": "2020-10-12",
      "endDate": "2021-12-15",
      "summary": "The Kibana organization created a new team-- Presentation-- responsible for [Canvas](https://www.elastic.co/what-is/kibana-canvas), [Dashboard](https://www.elastic.co/kibana/kibana-dashboard), and any other product considered a \"presentation container\".  I became the Area Lead for this new team, coordinating efforts between these products and the rest of Kibana.  I continued my previous responsibilites, this time on a larger scale: overseeing and coordinating technical efforts, representing the team across the org, and contributing significant or moonshot enhancements.",
      "highlights": [
        "[kibana/103202](https://github.com/elastic/kibana/pull/103202): Convert Canvas to use Service Abstractions API",
        "[kibana/102446](https://github.com/elastic/kibana/pull/102446): New Canvas Homepage",
        "[kibana/95435](https://github.com/elastic/kibana/pull/95435): \"Labs\" service for enabling experimental projects.",
        "[kibana/88112](https://github.com/elastic/kibana/pull/88112): Plugin Services abstraction and shared component library.",
        "[kibana/51318](https://github.com/elastic/kibana/issues/51318): Coordinated completion of \"Time to Visualize\"."
      ]
    },
    {
      "company": "Elastic",
      "position": "Area Lead, Canvas",
      "startDate": "2018-10-01",
      "endDate": "2020-10-12",
      "summary": "In October of 2018, I accepted a role with [Elastic](https://www.elastic.co) to work on [Kibana](https://www.elastic.co/kibana), specifically a new, ground-breaking beta plugin called [Canvas](https://www.elastic.co/what-is/kibana-canvas).  Soon after, I was named the new Area Lead.  I was responsible for overseeing and coordinating our technical efforts, representing the team across the org, and contributing significant or moonshot enhancements.\n\nDuring my tenure I directed project efforts for 1 major and 9 minor releases, including the General Availability (GA) release of Canvas from beta.  I introduced a number of technologies and architecture approaches that stabilized and enhanced the plugin, and oversaw migration of valuable bespoke technology to the Kibana ecosystem, (e.g. [`expressions`](https://www.elastic.co/guide/en/kibana/current/kibana-expressions-plugin.html)).",
      "highlights": [
        "[kibana/46278](https://github.com/elastic/kibana/pull/46278): Built novel means of embedding Canvas Workpads.",
        "[kibana/38850](https://github.com/elastic/kibana/pull/38850): Introduced [Storybook](https://storybook.js.org) for rapid development and testing.",
        "[kibana/36252](https://github.com/elastic/kibana/pull/36252): Introduced internationalization architecture.",
        "[kibana/35087](https://github.com/elastic/kibana/pull/35087): Introduced Typescript.",
        "[kibana/31734](https://github.com/elastic/kibana/pull/31734): Significant React performance investigation."
      ]
    },
    {
      "company": "Facebook NYC",
      "position": "User Interface Engineer",
      "startDate": "2015-04-01",
      "endDate": "2018-06-01",
      "summary": "When I first moved to the NYC Facebook office, I joined the Composer team for a \"hack-a-quarter\", converting the Composer to React, and then worked on the Share Dialog.\n\nEventually Events found themselves with a large number of React and Relay projects, so I rejoined my former team remotely. I built the new Events Dashboard and Permalink, and implemented many \"under the hood\" improvements.",
      "highlights": [
        "New Events Dashboard for desktop in Relay.",
        "New Events Dashboard for the mobile site in XHP.",
        "New Events Permalink for all web surfaces in XHP.",
        "New React + Flux Composer, and the new Share Dialog using that component.",
        "New 'Minutiae' controls-- the structured data (Photos, Activity, Tags) found in Composer."
      ]
    },
    {
      "company": "Facebook Vancouver",
      "position": "User Interface Engineer",
      "startDate": "2013-08-01",
      "endDate": "2015-04-01",
      "summary": "In 2013 I joined the Vancouver office with an amazing cadre of engineers from all over the world. With a Canadian fiance, it made sense for me to bring Facebook experience (and culture) to a group of \"n00bs\".\n\nWhile there, I worked on the Protect and Care team developing a new Messaging Inbox built in React. I also implemented the Open Graph Share dialog for FB Platform in XHP.",
      "highlights": [
        "New Help Center Inbox for desktop in React.",
        "New \"How-to\" panels for the Help Center.",
        "New Platform Share Dialog for mobile and desktop in XHP."
      ]
    },
    {
      "company": "Facebook HQ",
      "position": "User Interface Engineer",
      "startDate": "2012-01-01",
      "endDate": "2013-08-01",
      "summary": "I joined Facebook in 2012 as a User Interface Engineer (UIE) on the Mobile Core Web team.  I then joined the Accessibility team to help make Facebook more useful to everyone on the web.\n\nAfter several hackathons involving Events, I joined the team full time to rewrite the web experiences on both the mobile and main website.\n\nAfterwards, I spent some time with the Platform team, reworking a number of different web flows, like OAuth, and embeddable components like Share, Hashtags and Topics.",
      "highlights": [
        "New OAuth flow dialogs for developers using Facebook.",
        "New Share, Hashtags and Topics plugins for developers.",
        "New mobile web experience for the Events Dashboard and Permalink.",
        "Improved the Accessibility of Facebook, including a new way to \"see\" photos.",
        "New core components for mobile web for product teams."
      ]
    },
    {
      "company": "Cerner Corporation",
      "position": "Web Evangelist",
      "startDate": "2009-10-01",
      "endDate": "2012-01-01",
      "summary": "As Cerner's first Web Evangelist, I was responsible for advancing web best-practices to teams, both existing and emerging. I basically served as ad-hoc advisor with respect to semantics, accessibility, web agnostics and the responsible use of CSS and JavaScript.",
      "highlights": [
        "New OpenID SDK for the iPhone.",
        "Redesigned a semantic search servive to use JSON-P",
        "\"Proscenium\", an experimental technique of compiling templates in JS libaries for isomorphic rendering.",
        "Spoke about Progressive Enhancement as a necessary philosophy."
      ]
    },
    {
      "company": "Socially Adept Geek, LLC",
      "position": "Principal Architect",
      "startDate": "2010-10-01",
      "endDate": "2012-01-01",
      "summary": "In my spare time I operated a consultancy where I helped clients and friends with custom code, strategies and advice on their web projects.\n\nI shuttered this consulting business as part of my agreement to work at Facebook.",
      "highlights": []
    },
    {
      "company": "Cerner Corporation",
      "position": "Software Architect",
      "startDate": "2007-01-01",
      "endDate": "2009-10-01",
      "summary": "For a several years I was a Software Architect for Healthe, enforcing cross-browser compatibility, semantic markup and accessibility, developing CSS layouts and advanced JavaScript controls, and conducting platform research.  I would also prototype HTML code based on paper designs, allowing the team to communicate intent to clients, stakeholders, usability and engineers.",
      "highlights": [
        "Inculcated a comprehensive browser-agnostic web philosophy, massively improving accessibility, portability and performance.",
        "Invented the 'Web Bootstrapper', a patented technology that allowed semantic web pages to adapt to the heuristics of any device, dynamically.",
        "Consultant and mentor to teams and engineers on web technology and development."
      ]
    },
    {
      "company": "Cerner Corporation",
      "position": "Sr. Software Engineer",
      "startDate": "2005-01-01",
      "endDate": "2007-01-01",
      "summary": "For several years I worked on the ePrescribing (eRx) and Community Health Record (CHR) solutions for treating Medicare populations in several states. I would interpret functional requirements into a coherent user interface and visual design.",
      "highlights": [
        "Proposed and built the \"New Navigation\" project, which was a radical redesign of the UI based on usability studies and feedback from sales.",
        "Novel architecture pattern discarding JSPs in favor of full modules of aggregate presentation components, adding entire workflows to any WAR using standard J2EE and Struts configurations.",
        "Mentored software engineers and other architects in semantic markup practices and prudent Javascript."
      ]
    },
    {
      "company": "Cerner Corporation",
      "position": "Application Developer",
      "startDate": "2003-10-01",
      "endDate": "2005-01-01",
      "summary": "When I joined Cerner, I took on the role of Presentation Layer Developer for the \"Web Experience\" solution, specifically Order Management. I would design, document, and develop the UI for order placement, drug catalog browsing, and proactive interaction checking and alerting.",
      "highlights": [
        "Reusable, component-based rendering system which resulted in an 80% reduction in markup in JPSs, as well as sharing between solutions.",
        "Subject matter expert for most presentation layer technologies, and reviewed most of that code from my (and other) teams.  I ended up teaching a few courses for new associates."
      ]
    },
    {
      "company": "Sprint",
      "position": "Application Developer II",
      "startDate": "2003-06-01",
      "endDate": "2003-10-01",
      "summary": "I held a brief role at Sprint, transitioning from Accenture Outsourcing to Sprint PCS. I rolled on to the Architecture team, and was responsible for applying design patterns, creating interfaces to back-end applications, and overseeing code development across releases.",
      "highlights": []
    },
    {
      "company": "Accenture",
      "position": "Outsourced Analyst",
      "startDate": "2001-07-01",
      "endDate": "2003-06-01",
      "summary": "Employed as an Analyst in the Outsourcing organization for a number of client engagements.",
      "highlights": [
        "At a Wireless Telecom engagement, I wrote web-based Java interfaces for a customer care billing platform.",
        "At a Long Distance Telecom engagement, I was on-call and responsible for monitoring load balance and processing time on switches using SQL.",
        "At a Broadband Telecom engagement, I created test plans for development teams across the US and Canada."
      ]
    },
    {
      "company": "Symbol Technologies",
      "position": "Intern",
      "startDate": "1998-01-01",
      "endDate": "2001-01-01",
      "summary": "I spent three summers writing complete web-based applications for quality control efforts.",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "Rockhurst University",
      "courses": [],
      "startDate": "1997-09",
      "endDate": "2001-08"
    }
  ],
  "awards": [
    {
      "flavor": "nomination",
      "title": "Irene Ryan Acting Scholarship",
      "date": "2001-05-01",
      "awarder": "KC/ACTF",
      "summary": "Three-time nominee for excellence in Acting."
    },
    {
      "flavor": "award",
      "url": "https://web.archive.org/web/20140822164240/http://library.thinkquest.org/10502/",
      "title": "2nd Place - Arts and Literature",
      "date": "1997-10-01",
      "awarder": "ThinkQuest",
      "summary": "Created \"Shakey's Place\", a website about Shakespeare featuring a 3D Globe Theatre. Placed Second in Arts and Literature category totaling $48,000 in scholarships. Team Leader, designed interface and 3D graphics, programmed Perl 5 scripts, designed HTML layout."
    }
  ],
  "publications": [
    {
      "name": "Web Presentation Layer Bootstrapping for Accessibility and Performance",
      "publisher": "W4A",
      "releaseDate": "2009-04-20",
      "website": "https://dl.acm.org/citation.cfm?id=1535654.1535671",
      "summary": "In this paper, I present a the Web Bootstrapper, a technique that allows a developer to write a single site while still providing multiple experiences, or \"skins,\" without altering source or running costly client-side code. It is a process by which an accurate collection of only those static resources and metadata necessary for a unique experience be delivered passively, by the most performant means possible."
    }
  ],
  "references": [
    {
      "name": "Erik Vorhes",
      "reference": "Clint is one of the best engineers I’ve worked with. He is especially passionate about making products available to as many people as possible — not only in terms of pushing for accessibility best practices and for inclusive design, but also in making sure to make things available to people whose devices aren’t the latest and greatest devices and whose internet connections are suboptimal. Clint is capable of building things quickly and at a high standard of excellence while also demonstrating compassion for the people who use the things he builds."
    },
    {
      "name": "Patrick Keenan",
      "reference": "Clint is a powerhouse of code and collaboration. He single handedly maintained and updated the product on web, refactoring when appropriate. He was proactive in working with design and also brought good questions to help round out the approach. Even in a remote office, it felt like he was always ready to help out."
    },
    {
      "name": "Freddy Gottesman",
      "reference": "Clint is a motivated and creative engineer with exceptional product sense. In my time working with him I was impressed by his ability to identify a user problem, design a solution and then implement the code to make it happen."
    },
    {
      "name": "Jacob McDaniel",
      "reference": "Hands down, Clint is by far one of the most intelligent engineers I have had the opportunity of working near. As an experience designer working with an engineer, building the most intuitive and functionally sound experience is critical. Clint brings a different perspective to the table and isn't afraid to get his hands dirty. He has an incredible capability of asking comprehensive questions to understand the requirements and data for building the appropriate solution. If given the opportunity in the future to work with Clint, I would sprint versus walk."
    },
    {
      "name": "Naithan Jones",
      "reference": "Clint worked as an consulting engineer on the initial build of my first venture backed product. Thoughtful and pragmatic engineer with advanced understanding of how to scale code for future usability and performance. One of the strongest engineers I know and a great all around person to boot. Would highly recommend Clint."
    },
    {
      "name": "David Cacioppo",
      "reference": "Clint delivers on what he says he will and brings great ideas to the table. If you get the opportunity to work with Clint, bring him in early in the concept phase of your project. Odds are, he will have input that makes your project better."
    },
    {
      "name": "Scott Ackerson",
      "reference": "Clint Hall embodies all that is web. His code, ideas and passion for all things web extend past his professional career into his social and personal life. He is un-conventional only in the fact that he is ahead of the thought leadership and natural curve of web developers. He also has a certain social adeptness that garners many opportunities for him and those around him."
    },
    {
      "name": "Bo Fishback",
      "reference": "Clint is a great guy to work with. He's a sharp, curious, problem solver and has both a deep knowledge base to draw from and an impressive capacity to learn quickly and apply new skills. I've had the chance to work with him on multiple occasions at multiple different companies and have been impressed at every turn."
    }
  ]
}